app/controllers/eventos_controller.rb

INSERT INTO "eventos" ("descricao", "tipoEvento", "localEvento", "dataInicio", "horaInicio", "horaFim", "numPessoas", "precoPorPessoa", "dataInicioEvento", "dataFimEvento", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @evento = Evento.new(evento_params)

    respond_to do |format|
      if @evento.save

UPDATE "eventos" SET "dataInicio" = ?, "horaInicio" = ?, "horaFim" = ?, "updated_at" = ? WHERE "eventos"."id" = ?  [["dataInicio", "2016-02-09"], ["horaInicio", "2000-01-01 22:00:00.000000"], ["horaFim", "2000-01-01 03:00:00.000000"], ["updated_at", "2016-02-03 16:42:05.499467"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @evento.update(evento_params)