app/controllers/funcionarios_controller.rb

    def set_funcionario
      @funcionario = Funcionario.find(params[:id])
---
SELECT  "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = ? LIMIT 1